routes/web.php

select * from `sliders`
select * from `products` limit 8 offset 0
select count(*) as aggregate from `products`
select count(*) as aggregate from `visitors`
---
    Route::spladeUploads();

    Route::get('/', function () {
        $sliders = Slider::all();
        $products = App\Models\Product::paginate(8);
        $visitorCount = Visitor::count();