app/Http/Controllers/CartController.php

select * from `carts` where `carts`.`user_id` = 1 and `carts`.`user_id` is not null
select * from `products` where `products`.`id` = 2 limit 1
---
    public function index()
    {

        // dd(auth()->user()->cartItem());
        if( auth()->user())
        {
            $cartItems = auth()->user()->cartItem;
    $totalPrice = 0;
    foreach($cartItems as $item) {

    $totalPrice += ($item->product->price *$item->quantity);
    }
    session(['total_price' => $totalPrice]);
        $cartItems = auth()->user()->cartItem;

        return view('cart')->with ('cartItems',$cartItems)->with('totalPrice',$totalPrice);


        }
        else {
        $cart = session('cart',[]);


        foreach ($cart as &$item) {
            $product = Product::find($item['product_id']);

insert into `carts` (`product_id`, `quantity`, `user_id`, `updated_at`, `created_at`) values (2, '2', 1, '2024-05-21 06:30:40', '2024-05-21 06:30:40')
select * from `carts` where `carts`.`user_id` = 1 and `carts`.`user_id` is not null and (`product_id` = 2 and `quantity` = '2') limit 1
---
    public function addToCart(Product $product ,Request $request){

    if($request->input('passingQuantity')){
        $quantity = $request->input('passingQuantity');

    }
    else{
        $quantity = 1;
    }
    // dd($quantity);
        if( auth()->user()){
            $cartItems = auth()->user()->cartItem();

            // $cartItems = auth()->user()->cartItem;
            // dd( $cartItems);
            foreach (auth()->user()->cartItem as $cartItem) {
                if ($cartItem->product_id === $product->id) {
                    Toast::success('Product already exists!')->autoDismiss(2);
                    return redirect()->back();
                }
            }

        $cartItems->updateOrCreate([

    'product_id' => $product->id,
    'quantity'=>$quantity,

]);