app/Http/Controllers/OrderController.php

select * from `orders` where `orders`.`user_id` = 1 and `orders`.`user_id` is not null
---
    public function myOrder(){
        // dd(auth()->user()->order);
        $order=auth()->user()->order;

insert into `orders` (`user_id`, `shipping_address_id`, `coupon_id`, `total_amount`, `discount_amount`, `updated_at`, `created_at`) values (1, 12, 1, 20, '', '2024-05-21 06:31:36', '2024-05-21 06:31:36')
---
    ]);
     if ($shippingAddress){
        // dd($shippingAddress->id);ss
        $order = Order::create([
            'user_id' =>auth()->check() ? auth()->user()->id : $user->id,
            'shipping_address_id' => $shippingAddress->id,
            'coupon_id' => 1,
            'total_amount'=>$sessionDetails['checkoutPrice']['subtotal'],
            'discount_amount'=>$sessionDetails['checkoutPrice']['discount']
        ]);

delete from `carts` where `id` = 4
---
                        // 'price'=>$cart->price,
                    ]);
                    // $cart->product->stock --;
                    $cart->delete();

insert into `order_items` (`order_id`, `product_id`, `quantity`, `updated_at`, `created_at`) values (12, 2, 2, '2024-05-21 06:31:36', '2024-05-21 06:31:36')
---
        else{
            $cart = session('cart',[]);
            foreach ($cart as &$item) {
                Order_item::create([
                    'order_id'=>$order->id,
                    'product_id'=>$item['product_id'],
                    'quantity'=>$item['quantity'],

                ]);

select * from `orders` where `orders`.`id` = 12 limit 1
---

// ]);

   $mailContents =Order::find($order->id);