app/Http/Controllers/ProductController.php

    public function store(StoreProductRequest $request)
    {


        $imagePath = $request->file('image')->store('products', 'public');
        $originalFilename = $request->file('image')->getClientOriginalName();
        $product = Product::create([
            'name' => $request->name,
            'description' => $request->description,
            'price' => $request->price,
            'weight' => $request->weight,
            'stock' => $request->stock,


        ]);
        $product->media()->create([
            'product_id' =>$product->id,
            'file_name'=>$originalFilename,
            'file_path'=>$imagePath
        ]);
---
insert into `products` (`name`, `description`, `price`, `weight`, `stock`, `updated_at`, `created_at`) values ('black marich', 'abcd', '190', '200', '13', '2024-05-21 06:16:14', '2024-05-21 06:16:14')
insert into `product_media` (`product_id`, `file_name`, `file_path`, `updated_at`, `created_at`) values (6, 'Black Pepper Whole.JPG', 'products/p2UfdHi3RVFcEk9HhZsM3cDmDQOEBoFxbU9yxC28.jpg', '2024-05-21 06:16:14', '2024-05-21 06:16:14')